Repository: doubleden/RustQuiz
Catalog: RustQuiz/Localization/Localizable.xcstrings
Source language: en
Languages: ru

source: Type whose size is computed at runtime
ru: Тип, размер которого вычисляется во время выполнения

source: Type whose size is only known at runtime
ru: Тип, размер которого известен только во время выполнения

source: Type without unsafe
ru: Тип без unsafe

source: Type-specific construction
ru: Конструкция, ориентированная на конкретный тип

source: Types and formats can work together without direct dependencies
ru: Типы и форматы могут работать вместе без прямой зависимости

source: Types are incompatible without conversion
ru: Типы несовместимы без преобразования

source: Types implement the top layer, formats implement the bottom, and they interoperate through visitors
ru: Типы реализуют верхний уровень, форматы - нижний, а взаимодействуют они через посетителей

source: Typically use match, if let, or methods. Rust requires handling None
ru: Обычно это use match , if let , или методы. Rust требует обработки None

source: Typing
ru: Типирование

source: u8 with ASCII value
ru: u8 со значением ASCII

source: Uncompleted Quiz
ru: Не завершенный квиз

source: Undefined behavior
ru: Неопределенное поведение

source: Undefined behavior due to aliasing rule violation
ru: Неопределенное поведение из-за нарушения правила алиасинга

source: Underscores allowed for readability
ru: Подчеркивания позволяют читать for

source: Understanding Ownership
ru: Понимание собственности

# understanding_ownership_link
source: https://doc.rust-lang.org/book/ch04-00-understanding-ownership.html
ru: https://doc.rust-lang.ru/book/ch04-00-understanding-ownership.html

source: Unicode scalar chars
ru: Скалярные символы Юникода

source: Unit tests are always public, integration are private
ru: Модульные тесты всегда публичны, интеграционные - приватны

source: Unit tests are written inside src, integration in tests folder
ru: Модульные тесты пишутся в папке src, интеграционные in

source: Unit tests live in the same file, integration in separate tests/ directory
ru: Юнит-тесты живут in одном файле, интеграция in отдельном каталоге tests/

source: Unit tests only run with nightly
ru: Юнит-тесты запускаются только в ночном режиме

source: Unit tests require Cargo.toml, integration don't
ru: Модульные тесты требуют Cargo.toml, интеграционные - нет

source: Universal green threads
ru: Универсальная зеленая резьба

source: Unlimited
ru: Неограниченное количество

source: Unpin indicates moving the type is safe
ru: Разъединение указывает на то, что перемещение type безопасно

source: unsafe doesn't disable the borrow checker and other Rust safety checks
ru: unsafe не отключает проверку заимствований и другие проверки безопасности Rust

source: Unsafe functions must be called inside unsafe block
ru: Небезопасные функции должны вызываться внутри блока unsafe

source: Unsafe gives five abilities: dereferencing raw pointers, calling unsafe functions, accessing mutable static, implementing unsafe trait, and accessing union fields
ru: Unsafe предоставляет пять возможностей: разыменование необработанных указателей, вызов функций unsafe, доступ к мутабельным static, реализация unsafe trait и доступ к полям объединения

source: Unsafe Rust is part of the language that doesn't enforce memory safety guarantees, giving programmers more control
ru: Unsafe Rust - это часть языка, в которой не соблюдаются гарантии безопасности памяти, что дает программистам больше возможностей для контроля

source: Unsafe to continue afterwards
ru: После этого небезопасно посещать сайт continue

source: Unsafe trait has requirements that compiler cannot automatically verify
ru: Небезопасный trait имеет требования, которые компилятор не может проверить автоматически

source: Unsafe trait is declared with unsafe keyword before trait
ru: Небезопасный trait объявляется с ключевым словом unsafe перед trait

source: Unsigned
ru: Беззнаковые

source: unwrap
ru: развернуть

source: unwrap_or_else accepts a closure that executes on None
ru: unwrap_or_else принимает закрытие, которое выполняется на None

source: unwrap_or_else lazily computes the value only if None
ru: unwrap_or_else лениво вычисляет значение только if None

source: unwrap()
ru: развернуть()

source: update_average is an internal implementation detail that doesn't require public access
ru: update_average - это внутренняя деталь реализации, которая не требует публичного доступа

source: upgrade()
ru: обновление()

source: upgrade() → Option<Rc<T>>, if object still alive
ru: обновление() → Option&ltRc<T>&gt;, if объект еще жив

source: upgrade() returns Option
ru: upgrade() возвращает Option

source: Usable with @
ru: Можно использовать с @

source: Use ..other_struct. Saves code when creating new instances
ru: Используйте ..other_struct. Экономия кода при создании новых экземпляров

source: Use .get(), which returns Option<&V>
ru: Используйте .get(), которая возвращает Option<&V>

source: Use {:?} and #[derive(Debug)]
ru: Используйте {:?} и #[derive(Debug)]

source: Use #![allow(warnings)]
ru: Используйте #![allow(warnings)]

source: Use a global variable
ru: Используйте глобальную переменную

source: Use a tuple
ru: Используйте кортеж

source: Use an enum
ru: Используйте enum

source: Use as for an alias
ru: Используйте as for псевдоним

source: Use Box instead of Rc
ru: Используйте Box вместо Rc

source: Use Box<T>
ru: Используйте Box<T>

source: use brings a name into scope; pub use also makes it accessible to external users
ru: use вводит имя в область действия; pub use также делает его доступным для внешних пользователей

source: use can't be used in lib.rs
ru: use не может быть использован in lib.rs

source: Use clone inside the closure
ru: Используйте клон внутри замка

source: Use const keyword
ru: Используйте ключевое слово const

source: Use CStr::from_ptr() then to_str()
ru: Используйте CStr::from_ptr(), затем to_str()

source: Use dot notation. Similar to C/Java in this respect
ru: Используйте точечную нотацию. В этом отношении она похожа на C/Java in

source: Use give_back
ru: Используйте give_back

source: Use if let or let...else
ru: Используйте if let или let...else

source: Use immutable! macro
ru: Используйте неизменяемые! macro

source: Use in a loop
ru: Используйте in a loop

source: Use instance.method(). Rust performs auto-ref
ru: Используйте instance.method(). Rust выполняет автоref

source: use is limited to the current scope
ru: use ограничивается текущей областью

source: Use macros for code generation
ru: Использование макросов for Генерация кода

source: Use match
ru: Используйте match

source: Use more Deref implementations
ru: Используйте больше реализаций Deref

source: Use multiple move keywords
ru: Используйте несколько ключевых слов move

source: Use mut keyword
ru: Используйте ключевое слово mut

source: Use only glob
ru: Используйте только глобус

source: use path::to::func
ru: use путь::к::func

source: use path::to::module; module::func();
ru: use путь::к модулю::; модуль::func();

source: Use ptr::read()
ru: Используйте ptr::read()

source: Use pub mod
ru: Используйте pub mod

source: Use RefCell
ru: Используйте RefCell

source: Use RefCell<T>
ru: Используйте RefCell<T>

source: use shortens the path to refer to HashMap directly
ru: use сокращает путь, чтобы обратиться к HashMap напрямую

source: Use static strings only
ru: Используйте только строки static

source: use std::collections::HashMap
ru: use std::коллекции::HashMap

source: Use String::from_raw_parts()
ru: Используйте String::from_raw_parts()

source: Use the struct keyword with braces. Rust has no Java/Kotlin-style class or object
ru: Используйте ключевое слово struct со скобками. В Rust нет классов или объектов в стиле Java/Kotlin

source: Use traits or write explicit facade methods
ru: Используйте трейты или пишите явные фасадные методы

source: Use Type::func(). There's no instance binding
ru: Используйте тип::func(). Нет привязки к экземпляру

source: Use unsafe
ru: Используйте unsafe

source: Use unsafe code
ru: Используйте код unsafe

source: Use variable rebinding in a separate scope before the closure
ru: Используйте перепривязку переменных in отдельную область видимости перед закрытием

source: Use Vec<dynamic>
ru: Используйте Vec<dynamic>

source: Use Weak in edges where ownership not required
ru: Используйте слабые края in where владение не требуется

source: Use Weak<T> for parent reference
ru: Используйте слабую<T> for родительскую ссылку

source: Use without move - borrowing
ru: Использование без move - заимствование

source: use works only in binaries
ru: use работает только in двоичные файлы

source: Use yield
ru: Используйте yield

source: Used for behavior, not data. Handy when implementing a trait
ru: Используется for поведение, а не данные. Удобно при реализации trait

source: Used for indices/sizes
ru: Используемые индексы/размеры for

source: User { active: true, username: ..., email: ..., sign_in_count: 1 }
ru: Пользователь { active: true, username: ..., email: ..., sign_in_count: 1 }

source: User { email, username }
ru: Пользователь { email, имя пользователя }

source: User { email: "x", ..user1 }
ru: Пользователь { email: "x", ..user1 }

source: User { email: "x", user1 }
ru: Пользователь { email: "x", user1 }

source: User { email: email, username: username }
ru: Пользователь { email: email, username: username }

source: User input
ru: Ввод данных пользователем

source: user->email
ru: пользователь->электронная почта

source: User::from(email, username)
ru: Пользователь::from(email, имя пользователя)

source: User::new(...) — always
ru: Пользователь::new(...) - всегда

source: User::update(user1, "x")
ru: Пользователь::update(user1, "x")

source: User(email, username)
ru: Пользователь(email, имя пользователя)

source: Users can work more efficiently when behavior matches expectations
ru: Пользователи могут работать более эффективно, если их поведение соответствует ожиданиям

source: Users should always be confused
ru: Пользователи всегда должны быть в замешательстве

source: Users should never understand the system
ru: Пользователи никогда не должны понимать систему

source: Users shouldn't know whether a service is implemented through storage or computation
ru: Пользователи не должны знать, реализован ли сервис через хранилище или через вычисления

source: Uses less memory
ru: Использует меньше памяти

source: Uses more memory
ru: Использует больше памяти

source: Uses too much memory
ru: Использует слишком много памяти

source: Uses unsafe
ru: Используется unsafe

source: Using ? inside the test
ru: Используя ? внутри test

source: Using .. twice creates ambiguity — unclear how many elements to ignore
ru: Использование ... дважды создает двусмысленность - неясно, сколько элементов игнорировать

source: Using .append(option)
ru: Использование .append(option)

source: Using .chain(option.iter())
ru: Использование .chain(option.iter())

source: Using .clone() to make compiler errors disappear without understanding ownership
ru: Использование .clone() для устранения ошибок компилятора без понимания права собственности

source: Using .extend_one(option)
ru: Использование .extend_one(option)

source: Using .push(option)
ru: Использование .push(option)

source: Using &T instead of &Box<T> avoids unnecessary levels of indirection
ru: Использование &amp;T вместо &ampBox<T> позволяет избежать ненужных уровней косвенности

source: Using + operator repeatedly
ru: Многократное использование оператора +

source: Using a macro
ru: Использование macro

source: Using a mutable variable and a for loop
ru: Использование изменяемой переменной и for loop

source: Using a null-check
ru: Использование проверки нуля

source: Using borrowed types like &str increases flexibility by accepting both &String and &str through automatic coercion
ru: Использование заимствованных типов, таких как &amp;str, повышает гибкость, поскольку они принимают как &amp;String, так и &amp;str через автоматическое принуждение

source: Using Box<dyn Trait> allows storing different types that implement the same trait in a collection
ru: Использование Box&lt;dyn Trait&gt; позволяет хранить различные типы, реализующие одну и ту же trait in коллекцию

source: Using clone() for type conversion
ru: Использование функции clone() for type

source: Using Deref for custom pointer types
ru: Использование Deref for пользовательских типов указателей

source: Using fold function
ru: Использование функции сгибания

source: Using format! macro
ru: Используем формат! macro

source: Using generics allows compile-time verification instead of runtime checks with Option
ru: Использование дженериков позволяет выполнять проверку во время компиляции вместо проверок во время выполнения с Option

source: Using map and reduce
ru: Использование map и reduce

source: Using push_str in a loop
ru: Использование push_str in a loop

source: Using recursion
ru: Использование рекурсии

source: Using String::from
ru: Использование String::from

source: Using Structs to Structure Related Data
ru: Использование структур для структурирования связанных данных

source: Using type aliases
ru: Использование псевдонимов type

source: Using unsafe
ru: Использование unsafe

# using_structs_link
source: https://doc.rust-lang.org/book/ch05-00-structs.html
ru: https://doc.rust-lang.ru/book/ch05-00-structs.html

source: usize is too small
ru: usize слишком маленький

source: UTF-8 bytes
ru: Байты UTF-8

source: UTF-8 has variable width
ru: UTF-8 имеет переменную ширину

source: V4(u8,u8,u8,u8) and V6(String) are valid together. Enums support heterogeneous data
ru: V4(u8,u8,u8,u8) и V6(String) действительны вместе. Перечисления поддерживают разнородные данные

source: Valid comment:
ru: Верный комментарий:

source: Valid constant declaration:
ru: Допустимое объявление константы:

source: Valid function with parameter:
ru: Действительная функция с параметром:

source: Value erasure
ru: Стирание значений

source: Variable length
ru: Переменная длина

source: Variable lifetime
ru: Переменный срок службы

source: Variable shadowing allows redeclaring a variable as immutable after initial processing
ru: Теневая обработка переменных позволяет повторно объявить переменную as неизменяемой после первоначальной обработки

source: Variable type
ru: Переменная type

source: Variables inside a function
ru: Переменные внутри функции

source: Variants are accessed with ::. Rust namespacing
ru: Доступ к вариантам осуществляется с помощью ::. Пространство имен Rust

source: Variants are private
ru: Варианты являются частными

source: Vec frees memory and calls drop for each element
ru: Vec освобождает память и вызывает drop for для каждого элемента

source: Vec is not Send
ru: Vec не отправлять

source: Vec is not Sync
ru: Vec не синхронизируется

source: Vec::new() creates an empty vector; the type is via annotation or later inference
ru: Vec::new() создает пустой вектор; type - через аннотацию или последующий вывод

source: vec! is the built-in macro for vector literals
ru: vec! - это встроенныйin macro for векторный литерал

source: Vec<&str>
ru: Vec&lt;&amp;str&gt;

source: Vec<Box<dyn Migration>>
ru: Vec&ltBox&lt;dyn Миграция&gt;&gt;

source: Vec<fn()>
ru: Vec&lt;fn()&gt;

source: Vec<String>
ru: Vec&lt;String&gt

source: Vec<T> for any T
ru: Vec<T> for любой T

source: Vec<T> stores data on the heap; its size can change at runtime
ru: Vec<T> хранит данные в куче; ее размер может меняться во время выполнения программы

source: Vec<u8> instead of CString
ru: Vec&lt;u8&gt; вместо CString

source: Vec<u8> provides mutable buffer for C code to modify, while CString is for read-only data
ru: Vec&lt;u8&gt; предоставляет изменяемый буфер for C-код для модификации, while CString - for данные, доступные только для чтения

source: Vector requires mut
ru: Вектор требует mut

source: version %@
ru: версия %@

source: Via pub mod
ru: Через сайт pub mod

source: Via return value from closure and join()
ru: Через return значение из закрытия и join()

source: Via self
ru: Через сайт self

source: view all
ru: все

source: Violation of "only one mutable reference" rule — panic with BorrowMutError
ru: Нарушение правила "только одна мутабельная ссылка" - паника с BorrowMutError

source: Visitor allows adding new operations without changing the data structures themselves
ru: Посетитель позволяет добавлять новые операции без изменения самих структур данных

source: Visitor and Fold both traverse structures, but Fold produces new data while Visitor operates on existing data
ru: Visitor и Fold оба обращаются к структурам, но Fold создает новые данные while Visitor работает с существующими данными

source: Visitor contains logic to construct/destruct between data type and Serde's data model
ru: Посетитель содержит логику для построения/деstruct between данных type и модели данных Серде

source: Visitor is faster than Fold
ru: Посетитель быстрее, чем папка

source: Visitor separates the algorithm for traversing from the operations on each element
ru: Посетитель отделяет алгоритм for обхода от операций над каждым элементом

source: Waits for all futures in a collection
ru: Ожидания for все фьючерсы in коллекция

source: walk_* functions for each datum type
ru: функции walk_* for для каждой точки отсчета type

source: walk_* functions provide default traversal behavior that can be shared between visitors
ru: функции walk_* обеспечивают стандартное поведение обхода, которое может быть использовано совместно посетителями

source: We do not use any analytics, tracking, or advertising services.
ru: Мы не используем какие-либо аналитические, отслеживающие или рекламные сервисы.

source: Weak breaks ownership cycles
ru: Слабые циклы владения

source: Weak doesn't prevent deallocation
ru: Слабость не предотвращает деаллокацию

source: Weak reference doesn't increment strong_count
ru: Слабая ссылка не увеличивает strong_count

source: Weak reference, not preventing deallocation
ru: Слабая ссылка, не предотвращающая деаллокацию

source: Weak references don't prevent deallocation
ru: Слабые ссылки не предотвращают удаление

source: Weak<T>
ru: Слабый<T>

source: Welcome future Rustocean!
ru: Добро пожаловать в Rust Quiz!

source: What about let guess: u32 = "42".parse().unwrap();?
ru: Как насчет let: u32 = "42".parse().unwrap();?

source: What about let x: u8 = 256; (debug)?
ru: А как насчет let x: u8 = 256; (отладка)?

source: What about the mod.rs style?
ru: А как насчет стиля mod.rs?

source: What advantage do small crates provide for compilation?
ru: Какое преимущество дают do маленькие ящики for компиляции?

source: What are fields in a struct?
ru: Что такое поля in a struct?

source: What are generics used for in Rust?
ru: Какие дженерики используются for in Rust?

source: What are lifetime annotations for?
ru: Что такое прижизненные аннотации for?

source: What are the three layers in Serde's design?
ru: Что представляют собой три слоя in дизайна Серде?

source: What are the three traits for closures?
ru: Каковы три признака for закрытия?

source: What are the two main operations in the Command pattern trait?
ru: Каковы две main операции in командного шаблона trait?

source: What are the two types of data in Object-Based APIs?
ru: Каковы два типа данных in объектно-ориентированных API?

source: What are unit-like structs used for?
ru: Для чего используются юнитоподобные структуры for?

source: What attribute prevents struct construction and exhaustive matching in external crates?
ru: Какой атрибут препятствует построению struct и исчерпывающему подбору in внешних ящиков?

source: What benefit does struct decomposition often reveal?
ru: Какую пользу часто приносит разложение struct?

source: What benefit does the Law of Demeter provide?
ru: Какую пользу приносит Закон Деметры?

source: What borrowing rules do raw pointers ignore?
ru: Какие правила заимствования do игнорируют сырые указатели?

source: What can you do with shadowing but not with mut?
ru: Что вы можете сделать do с помощью тени, но не с помощью mut?

source: What command-line argument can mitigate #![deny(warnings)] issues?
ru: Какой аргумент командной строки может смягчить проблемы #![deny(warnings)]?

source: What determines the observation pattern expected by the Visitor?
ru: Что определяет модель наблюдения, ожидаемую посетителем?

source: What do you lose when using if let instead of match?
ru: Что do вы теряете, если используете if let вместо match?

source: What do you need to call to actually execute map?
ru: Что нужно вызвать на do, чтобы выполнить карту?

source: What does ? do on Option<T>?
ru: Что означает ? do на Option<T>?

source: What does ?Sized mean in trait bound?
ru: Что означает ?Sized in trait bound?

source: What does .. do in patterns?
ru: Что означает ... do in узоры?

source: What does ..= syntax mean in patterns?
ru: Что означает синтаксис ..= в шаблонах in?

source: What does .len() do on [i32; 5]?
ru: Что означает .len() do на [i32; 5]?

source: What does "fearless concurrency" mean in Rust?
ru: Что означает "бесстрашный параллелизм" in Rust?

source: What does "field init shorthand" do?
ru: Что означает "шорткод полевой инициации" do?

source: What does "unwinding" mean during a panic?
ru: Что означает "разматывание" во время паники?

source: What does "Зд".bytes() do?
ru: Что означает "Зд".bytes() do?

source: What does "Зд".chars() do?
ru: Что означает "Зд".chars() do?

source: What does "Здравствуйте".len() return?
ru: Что означает "Здравствуйте".len() return?

source: What does * do with use?
ru: Что означает * do с use?

source: What does &self mean?
ru: Что означает &amp;self?

source: What does #[derive(Deserialize)] generate?
ru: Что генерирует #[derive(Deserialize)]?

source: What does #[macro_export] attribute do?
ru: Что означает атрибут #[macro_export] do?

source: What does 0b1111_0000 mean?
ru: Что означает 0b1111_0000?

source: What does a function signature with generics look like?
ru: Как выглядит подпись функции с дженериками?

source: What does a library crate conventionally specify?
ru: Что условно указывается в библиотеке crate?

source: What does a Poly Iso do?
ru: Что такое Poly Iso do?

source: What does a timeout method on a stream do?
ru: Что означает метод таймаута в потоке do?

source: What does a use apply to by default?
ru: На что по умолчанию распространяется действие use?

source: What does a vector's get method return?
ru: Что означает метод get вектора return?

source: What does an enum do in Rust?
ru: Что такое enum do in Rust?

source: What does as do in use?
ru: Что означает as do in use ?

source: What does assert_ne! do?
ru: Что означает assert_ne! do?

source: What does async fn function_name() -> T return?
ru: Что означает async fn function_name() -&gt; T return?

source: What does b'A' mean?
ru: Что означает "b'A"?

source: What does Box<dyn Draw> mean?
ru: Что означает Box&lt;dyn Draw&gt; означает?

source: What does Box<dyn Error> mean in main() -> Result<(), Box<dyn Error>>?
ru: Что означает Box&lt;dyn Ошибка&gt; означает in main () -&gt Result&lt;(), Box&lt;dyn Error&gt;&gt;?

source: What does Box<T> do?
ru: Что означает Box<T> do?

source: What does clone() do for String?
ru: Что означает clone() do for String ?

source: What does Command-Query Separation (CQS) state?
ru: Что означает разделение командных запросов (Command-Query Separation, CQS)?

source: What does Composition over Inheritance mean?
ru: Что означает композиция над наследованием?

source: What does Cons(Rc<RefCell<i32>>, Rc<List>) mean for mutation?
ru: Что означает Cons(Rc&ltRefCell&lt;i32&gt;&gt;, Rc<List>) означает мутацию for?

source: What does dbg! print for dbg!(30 * 2)?
ru: Что выводит dbg! for dbg!(30 * 2)?

source: What does Design by Contract (DbC) require?
ru: Что требует проектирование по контракту (DbC)?

source: What does extern "C" do?
ru: Что означает extern "C" do?
